# 指定编译器
CC = gcc

########################################
# target
# 最终生成的可执行文件名
########################################
TARGET = helloworld

########################################
# building variables
########################################
# debug build?
DEBUG = 1
# optimization
OPT = -Og

########################################
# paths
# 编译后生成文件的保存路径
########################################
BUILD_DIR = build

########################################
# source
########################################
C_SOURCES = \
src/main.c\

########################################
# 编译
########################################
all:$(BUILD_DIR)
	$(CC) -o $(BUILD_DIR)/$(TARGET) $(C_SOURCES)

$(BUILD_DIR):
	mkdir $@

.PHONY:clean

########################################
# clean up
########################################
clean:
	-rm  -fR $(BUILD_DIR)
	@echo "清除成功！"